{
    "CYYZ": {
        "station_name": "Toronto/Pearson Intl, ON, CA",
        "time_utc": "2025-02-08T04:00:00Z",
        "temperature_c": -6,
        "dew_point_c": -11,
        "wind_speed_kt": 6,
        "wind_direction": 240,
        "wind_gust_kt": null,
        "cloud_cover": "OVC",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                -79.629,
                43.679
            ]
        },
        "weather_description": "Good morning, Toronto! As we look at the weather right now at Pearson International Airport, we’re feeling a chilly -6 degrees Celsius. Bundle up, folks! The air is dry with a dew point sitting at -11 degrees, indicating that winter is holding its grip. We've got overcast skies, so you might want to keep that umbrella handy just in case! Winds are blowing in from the southwest at 6 knots, which adds a little bite to the air. Make sure to stay warm out there today!"
    },
    "OMDB": {
        "station_name": "Dubai Intl, DU, AE",
        "time_utc": "2025-02-08T04:00:00Z",
        "temperature_c": 21,
        "dew_point_c": 13,
        "wind_speed_kt": 8,
        "wind_direction": 160,
        "wind_gust_kt": null,
        "cloud_cover": "CAVOK",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                55.366,
                25.254
            ]
        },
        "weather_description": "Good morning, Dubai! It's a pleasant 21 degrees Celsius this morning, with a comfortable dew point at 13 degrees. We have a gentle breeze coming in from the southeast at 8 knots, making for a lovely start to the day. The sky is clear with CAVOK conditions, so no clouds to block that beautiful sunshine. Enjoy your day!"
    },
    "LTFM": {
        "station_name": "Istanbul Arpt, IS, TR",
        "time_utc": "2025-02-08T03:50:00Z",
        "temperature_c": 4,
        "dew_point_c": 2,
        "wind_speed_kt": 20,
        "wind_direction": 30,
        "wind_gust_kt": null,
        "cloud_cover": "BKN",
        "wx_code": "-SHRA",
        "geometry": {
            "type": "Point",
            "coordinates": [
                28.74,
                41.262
            ]
        },
        "weather_description": "Good morning, Istanbul! As we take a look at the current weather at the airport, temperatures are sitting at a chilly 4 degrees Celsius. The dew point is at 2 degrees, suggesting a slight chill in the air. We have a brisk wind coming from the northeast at 20 knots, adding to that winter feel. Cloud cover is broken, and we can expect some light rain showers as indicated by the weather code. So, grab your umbrella as you head out today, and stay warm!"
    },
    "KLAX": {
        "station_name": "Los Angeles Intl, CA, US",
        "time_utc": "2025-02-08T03:53:00Z",
        "temperature_c": 12.2,
        "dew_point_c": 11.7,
        "wind_speed_kt": 5,
        "wind_direction": 350,
        "wind_gust_kt": null,
        "cloud_cover": "SCT",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                -118.387,
                33.9382
            ]
        },
        "weather_description": "Good evening, Los Angeles! This is your weather update as of early morning. It’s currently a cool 12.2 degrees Celsius with a dew point not far behind at 11.7 degrees, indicating a bit of moisture in the air. We have some scattered clouds dotting the sky, and a light breeze from the north at about 5 knots. Overall, a pleasant winter morning in the City of Angels!"
    },
    "WIII": {
        "station_name": "Jakarta/Hatta Intl, JB, ID",
        "time_utc": "2025-02-08T04:00:00Z",
        "temperature_c": 29,
        "dew_point_c": 24,
        "wind_speed_kt": 10,
        "wind_direction": 310,
        "wind_gust_kt": null,
        "cloud_cover": "BKN",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                106.659,
                -6.125
            ]
        },
        "weather_description": "Good morning, Jakarta! It's a warm day ahead with temperatures currently sitting at a steamy 29 degrees Celsius. We've got a dew point of 24, creating a bit of humidity, so it might feel even warmer out there. The winds are coming in from the northwest at around 10 knots, which should help provide a nice breeze. The sky is partly cloudy, so you might see some breaks of sunshine in between those clouds. Overall, it looks like a lovely day to be out and about in the vibrant city of Jakarta!"
    }
}