{
    "CYYZ": {
        "station_name": "Toronto/Pearson Intl, ON, CA",
        "time_utc": "2025-02-07T19:00:00Z",
        "temperature_c": -3,
        "dew_point_c": -11,
        "wind_speed_kt": 20,
        "wind_direction": 270,
        "wind_gust_kt": 26,
        "cloud_cover": "BKN",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                -79.629,
                43.679
            ]
        },
        "weather_description": "Good evening, Toronto! We're looking at a chilly evening at Pearson International Airport with temperatures sitting at a brisk -3 degrees Celsius. The wind is picking up, gusting up to 26 knots from the west, bringing that wind chill factor into play, so bundle up if you're heading out! We've got broken clouds overhead, adding a bit of a gloomy feel to the day. The dew point is a frosty -11, indicating dry air. Overall, it's a typical winter evening here in the GTA. Stay warm!"
    },
    "OMDB": {
        "station_name": "Dubai Intl, DU, AE",
        "time_utc": "2025-02-07T19:00:00Z",
        "temperature_c": 23,
        "dew_point_c": 16,
        "wind_speed_kt": 8,
        "wind_direction": 100,
        "wind_gust_kt": null,
        "cloud_cover": "CAVOK",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                55.366,
                25.254
            ]
        },
        "weather_description": "Good evening, Dubai! As we take a look at the weather at Dubai International Airport this evening, we see a pleasant temperature of 23 degrees Celsius. The humidity is quite comfortable with a dew point of 16 degrees. There's a light breeze coming in from the east at 8 knots. The sky is clear with no significant cloud cover, so you can expect a lovely evening ahead. Enjoy your night out in the beautiful weather!"
    },
    "LTFM": {
        "station_name": "Istanbul Arpt, IS, TR",
        "time_utc": "2025-02-07T19:20:00Z",
        "temperature_c": 3,
        "dew_point_c": 1,
        "wind_speed_kt": 20,
        "wind_direction": 360,
        "wind_gust_kt": null,
        "cloud_cover": "BKN",
        "wx_code": "-SHRA",
        "geometry": {
            "type": "Point",
            "coordinates": [
                28.74,
                41.262
            ]
        },
        "weather_description": "Good evening! Our live report from Istanbul reveals a chilly evening with temperatures sitting at a brisk 3 degrees Celsius. We're experiencing a bit of a damp chill in the air, enhanced by a dew point of 1 degree. Winds are gusting from the north at 20 knots, providing a noteworthy breeze that may make it feel even colder. The skies are mostly cloudy, with broken clouds overhead and light rain showers in the area. So if you're heading out, be sure to bundle up and maybe grab an umbrella. Stay warm and safe out there!"
    },
    "WIII": {
        "station_name": "Jakarta/Hatta Intl, JB, ID",
        "time_utc": "2025-02-07T19:00:00Z",
        "temperature_c": 23,
        "dew_point_c": 22,
        "wind_speed_kt": 3,
        "wind_direction": 290,
        "wind_gust_kt": null,
        "cloud_cover": "OVC",
        "wx_code": "-TSRA",
        "geometry": {
            "type": "Point",
            "coordinates": [
                106.659,
                -6.125
            ]
        },
        "weather_description": "Good evening, Jakarta! As we look at the weather this evening at Hatta International Airport, we see overcast skies with light rain showers in the area. The temperature is a comfortable 23 degrees Celsius, with a dew point close behind at 22 degrees, making it feel quite humid outside. A gentle breeze is blowing in from the northwest at about 3 knots. So, grab your umbrella if you're heading out, as some scattered thunderstorms could develop. Stay safe and enjoy your evening!"
    }
}