{
    "CYYZ": {
        "station_name": "Toronto/Pearson Intl, ON, CA",
        "time_utc": "2025-02-07T19:00:00Z",
        "temperature_c": -3,
        "dew_point_c": -11,
        "wind_speed_kt": 20,
        "wind_direction": 270,
        "wind_gust_kt": 26,
        "cloud_cover": "BKN",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                -79.629,
                43.679
            ]
        },
        "weather_description": "Good evening, Toronto! As we take a look at the weather at Pearson International Airport, we're facing some chilly conditions this evening. The temperature is currently sitting at a brisk -3 degrees Celsius. With a dew point of -11, it feels quite cold out there. We have a steady westward wind blowing at 20 knots, with gusts reaching up to 26 knots, so you'll definitely want to bundle up if you're heading outside. The sky is partly cloudy, giving us a bit of a blanket cover but not entirely overcast. Overall, it's a wintry evening in the Greater Toronto Area, so stay warm!"
    },
    "OMDB": {
        "station_name": "Dubai Intl, DU, AE",
        "time_utc": "2025-02-07T19:00:00Z",
        "temperature_c": 23,
        "dew_point_c": 16,
        "wind_speed_kt": 8,
        "wind_direction": 100,
        "wind_gust_kt": null,
        "cloud_cover": "CAVOK",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                55.366,
                25.254
            ]
        },
        "weather_description": "Good evening, Dubai! As we take a glance at the current weather at Dubai International Airport, we find a pleasant temperature sitting at 23 degrees Celsius. The dew point is at a comfortable 16 degrees, indicating a slight humidity in the air. Winds are blowing from the east at 8 knots, creating just a gentle breeze. And it’s clear skies above with the cloud cover reported as CAVOK, meaning 'Ceiling and Visibility okay.' So, overall, it’s a lovely evening to be outdoors. Enjoy your night!"
    },
    "LTFM": {
        "station_name": "Istanbul Arpt, IS, TR",
        "time_utc": "2025-02-07T18:50:00Z",
        "temperature_c": 3,
        "dew_point_c": 1,
        "wind_speed_kt": 25,
        "wind_direction": 20,
        "wind_gust_kt": null,
        "cloud_cover": "BKN",
        "wx_code": "-SHRA",
        "geometry": {
            "type": "Point",
            "coordinates": [
                28.74,
                41.262
            ]
        },
        "weather_description": "Good evening, Istanbul! As we take a look at the weather at the airport, we find it quite chilly with a temperature of 3 degrees Celsius. The dew point is hovering at 1 degree, indicating some moisture in the air. We have a brisk wind blowing from the northeast at 25 knots, which might make it feel even cooler, so make sure to bundle up if you're heading out. The sky is mostly cloudy with broken clouds overhead, and there's light rain expected, so don't forget your umbrella! That's the latest from Istanbul; stay warm and safe out there!"
    },
    "KLAX": {
        "station_name": "Los Angeles Intl, CA, US",
        "time_utc": "2025-02-07T18:38:00Z",
        "temperature_c": 15,
        "dew_point_c": 12.2,
        "wind_speed_kt": 12,
        "wind_direction": 260,
        "wind_gust_kt": null,
        "cloud_cover": "BKN",
        "wx_code": null,
        "geometry": {
            "type": "Point",
            "coordinates": [
                -118.387,
                33.9382
            ]
        },
        "weather_description": "Good evening, Los Angeles! As we take a look at our current conditions at LAX, we're seeing a temperature of 15 degrees Celsius, which makes for a mild afternoon. The dew point sits at a cozy 12.2 degrees, indicating some humidity in the air. Winds are coming in from the west at 12 knots, providing a gentle breeze. We have broken clouds hanging around, so expect a partly cloudy sky as we transition into the evening. Overall, it's a lovely day in the City of Angels!"
    },
    "WIII": {
        "station_name": "Jakarta/Hatta Intl, JB, ID",
        "time_utc": "2025-02-07T19:00:00Z",
        "temperature_c": 23,
        "dew_point_c": 22,
        "wind_speed_kt": 3,
        "wind_direction": 290,
        "wind_gust_kt": null,
        "cloud_cover": "OVC",
        "wx_code": "-TSRA",
        "geometry": {
            "type": "Point",
            "coordinates": [
                106.659,
                -6.125
            ]
        },
        "weather_description": "Good evening, Jakarta! As we look at the weather at Hatta International, it's currently a warm 23 degrees Celsius with a dew point close behind at 22 degrees, keeping things quite humid. We're experiencing overcast skies, and there’s a chance of thunderstorms and rain in the area. The wind is gentle, coming from the northwest at 3 knots. So, if you're out and about tonight, don’t forget your umbrella just in case those storms roll in!"
    }
}